-- NeurondB: Detailed Basic Type and Operation Tests
-- Extension creation (should succeed, idempotent in tests)
DROP EXTENSION IF EXISTS neurondb CASCADE;
NOTICE:  drop cascades to 8 other objects
DETAIL:  drop cascades to column embedding of table test_vectors
drop cascades to column vec_1536 of table test_high_dim
drop cascades to column vec_256 of table test_high_dim
drop cascades to column vec_128 of table test_high_dim
drop cascades to column vec of table test_index_vectors
drop cascades to column vec of table test_aggregates
drop cascades to column vec2 of table test_distances
drop cascades to column vec1 of table test_distances
CREATE EXTENSION neurondb CASCADE;
-- ===============================
-- VECTOR TYPE (float32 dense)
-- ===============================
-- Type parsing: valid input
SELECT '[1.0, 2.0, 3.0]'::vector AS v1;
   v1    
---------
 [1,2,3]
(1 row)

SELECT array_to_string(vector_to_array('[1,2,3,4]'::vector), ',') AS arr_v2;
 arr_v2  
---------
 1,2,3,4
(1 row)

-- Type parsing: whitespace tolerance, scientific notation
SELECT '[ -3.5,4.01e1 , 0 , 2e-2]'::vector AS v3;
         v3         
--------------------
 [-3.5,40.1,0,0.02]
(1 row)

SELECT '[0]'::vector AS v_singleton;
 v_singleton 
-------------
 [0]
(1 row)

-- Implicit input/output/invariance
SELECT '[1.00,2.00]'::vector = '[1,2]'::vector AS eq_simple;
ERROR:  operator does not exist: vector = vector
LINE 1: SELECT '[1.00,2.00]'::vector = '[1,2]'::vector AS eq_simple;
                                     ^
HINT:  No operator matches the given name and argument types. You might need to add explicit type casts.
-- Edge: empty vector (should ERROR)
DO $$
BEGIN
  BEGIN
    PERFORM '[]'::vector;
    RAISE WARNING 'Empty vector allowed! Bug!';
  EXCEPTION WHEN OTHERS THEN
    RAISE NOTICE 'Correctly rejected empty vector: %', SQLERRM;
  END;
END$$;
NOTICE:  Correctly rejected empty vector: vector must have at least 1 dimension
-- vector_dims
SELECT vector_dims('[1,2,3,4,5]'::vector) AS dims_v4;   -- should be 5
 dims_v4 
---------
       5
(1 row)

SELECT vector_dims('[5]'::vector) AS dims_v5;           -- should be 1
 dims_v5 
---------
       1
(1 row)

-- Norm, normalization
SELECT vector_norm('[3,4]'::vector) AS norm_3_4;           -- 5.0 (L2)
 norm_3_4 
----------
        5
(1 row)

SELECT vector_normalize('[0,100]'::vector) AS unit_vec;
 unit_vec 
----------
 [0,1]
(1 row)

SELECT vector_norm(vector_normalize('[0,100]'::vector)) AS unit_norm; -- ~1
 unit_norm 
-----------
         1
(1 row)

-- Vector arithmetic
SELECT '[1,2,3]'::vector + '[4,5,6]'::vector AS v_add;
  v_add  
---------
 [5,7,9]
(1 row)

SELECT '[2,4]'::vector * 2.0 AS v_scale;
 v_scale 
---------
 [4,8]
(1 row)

SELECT '[6,9,12]'::vector / 3.0 AS v_div;
ERROR:  operator does not exist: vector / numeric
LINE 1: SELECT '[6,9,12]'::vector / 3.0 AS v_div;
                                  ^
HINT:  No operator matches the given name and argument types. You might need to add explicit type casts.
-- Concatenation
SELECT vector_concat('[1,2]'::vector, '[3,4]'::vector) AS vcat;
   vcat    
-----------
 [1,2,3,4]
(1 row)

-- ===============================
-- PACKED VECTORS (vectorp)
-- ===============================
SELECT vectorp_in('[1.0, 2.0, 3.0]')::text AS vp_parse;
ERROR:  function vectorp_in(unknown) does not exist
LINE 1: SELECT vectorp_in('[1.0, 2.0, 3.0]')::text AS vp_parse;
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
SELECT vectorp_dims(vectorp_in('[1.0, 2.0, 3.0, 4.0]')) AS vp_dims;
ERROR:  function vectorp_in(unknown) does not exist
LINE 1: SELECT vectorp_dims(vectorp_in('[1.0, 2.0, 3.0, 4.0]')) AS v...
                            ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
-- Edge: invalid (should fail)
DO $$
BEGIN
  BEGIN
    PERFORM vectorp_in('foo');
    RAISE WARNING 'vectorp_in accepted invalid!';
  EXCEPTION WHEN OTHERS THEN
    RAISE NOTICE 'vectorp_in correctly rejected invalid: %', SQLERRM;
  END;
END$$;
NOTICE:  vectorp_in correctly rejected invalid: function vectorp_in(unknown) does not exist
-- ===============================
-- SPARSE VECTOR MAP (vecmap)
-- ===============================
SELECT vecmap_in('{dim:10, nnz:3, indices:[0,3,7], values:[1.5,2.3,0.8]}')::text AS vm_parse;
ERROR:  function vecmap_in(unknown) does not exist
LINE 1: SELECT vecmap_in('{dim:10, nnz:3, indices:[0,3,7], values:[1...
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
-- Edge: missing field (should fail)
DO $$
BEGIN
  BEGIN
    PERFORM vecmap_in('{dim:10, indices:[1]}');
    RAISE WARNING 'vecmap_in accepted incomplete!';
  EXCEPTION WHEN OTHERS THEN
    RAISE NOTICE 'vecmap_in correctly rejected incomplete: %', SQLERRM;
  END;
END$$;
NOTICE:  vecmap_in correctly rejected incomplete: function vecmap_in(unknown) does not exist
-- ===============================
-- VECTOR GRAPH (vgraph)
-- ===============================
SELECT vgraph_in('{nodes:5, edges:[[0,1],[1,2],[2,3],[3,4]]}')::text AS vg_parse;
ERROR:  function vgraph_in(unknown) does not exist
LINE 1: SELECT vgraph_in('{nodes:5, edges:[[0,1],[1,2],[2,3],[3,4]]}...
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
-- Loop edge and multiedge
SELECT vgraph_in('{nodes:3, edges:[[0,0],[1,2],[1,2]]}')::text AS vg_loops;
ERROR:  function vgraph_in(unknown) does not exist
LINE 1: SELECT vgraph_in('{nodes:3, edges:[[0,0],[1,2],[1,2]]}')::te...
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
-- ===============================
-- RETRIEVAL TEXT (rtext)
-- ===============================
SELECT rtext_in('sample text for retrieval')::text AS rtxt_basic;
ERROR:  function rtext_in(unknown) does not exist
LINE 1: SELECT rtext_in('sample text for retrieval')::text AS rtxt_b...
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
SELECT rtext_in('こんにちは')::text AS rtxt_unicode;
ERROR:  function rtext_in(unknown) does not exist
LINE 1: SELECT rtext_in('こんにちは')::text AS rtxt_unicode;
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
SELECT rtext_in('')::text AS rtxt_empty;
ERROR:  function rtext_in(unknown) does not exist
LINE 1: SELECT rtext_in('')::text AS rtxt_empty;
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
-- Edge: binary/NULL (should fail)
DO $$
BEGIN
  BEGIN
    PERFORM rtext_in(E'\\xdeadbeef');
    RAISE WARNING 'rtext_in accepted binary!';
  EXCEPTION WHEN OTHERS THEN
    RAISE NOTICE 'rtext_in correctly rejected binary: %', SQLERRM;
  END;
END$$;
NOTICE:  rtext_in correctly rejected binary: function rtext_in(unknown) does not exist
